balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GA102.PIC
<?xml version="1.0" ?><edc:PIC edc:arch="24xxxx" edc:desc="" edc:informedby="DOS PS DS" edc:isextended="false" edc:name="PIC24FJ64GA102" edc:procid="0x00BF" xmlns:edc="http://crownking/edc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Power>
    <edc:VPP edc:defaultvoltage="3.250" edc:maxvoltage="3.500" edc:minvoltage="2.000"/>
    <edc:VDD edc:maxdefaultvoltage="3.500" edc:maxvoltage="3.500" edc:mindefaultvoltage="2.000" edc:minvoltage="2.000" edc:nominalvoltage="3.250"/>
  </edc:Power>
  <edc:Programming edc:memtech="ee" edc:tries="1">
    <edc:Wait edc:cfg="10000" edc:eedata="10000" edc:erase="600" edc:pgm="10000" edc:userid="10000"/>
    <edc:Latches edc:cfg="2" edc:eedata="2" edc:pgm="64" edc:rowerase="512"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="24xxxx" edc:name="24xxxx">
    <edc:MemTraits>
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ExtCodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xff7fff" edc:wordsize="0x4"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:UserIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ConfigFuseMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:DeviceIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:EEDataMemTraits edc:magicoffset="0x0"/>
      <edc:DataMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0x0" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:WatchdogTimer edc:min="1"/>
  <edc:InterruptList>
    <edc:Trap edc:cname="ReservedTrap0" edc:desc="Reserved"/>
    <edc:Trap edc:cname="OscillatorFail" edc:desc="Oscillator Fail Trap vector"/>
    <edc:Trap edc:cname="AddressError" edc:desc="Address error Trap vector"/>
    <edc:Trap edc:cname="StackError" edc:desc="Stack Error Trap vector"/>
    <edc:Trap edc:cname="MathError" edc:desc="Math Error Trap vector"/>
    <edc:Trap edc:cname="ReservedTrap5" edc:desc="Reserved"/>
    <edc:Trap edc:cname="ReservedTrap6" edc:desc="Reserved"/>
    <edc:Trap edc:cname="ReservedTrap7" edc:desc="Reserved"/>
    <edc:Interrupt edc:cname="INT0Interrupt" edc:desc="INT0 - External Interrupt 0" edc:irq="0"/>
    <edc:Interrupt edc:cname="IC1Interrupt" edc:desc="IC1 - Input Capture 1" edc:irq="1"/>
    <edc:Interrupt edc:cname="OC1Interrupt" edc:desc="OC1 - Output Compare 1" edc:irq="2"/>
    <edc:Interrupt edc:cname="T1Interrupt" edc:desc="T1 - Timer1" edc:irq="3"/>
    <edc:Interrupt edc:cname="IC2Interrupt" edc:desc="IC2 - Input Capture 2" edc:irq="5"/>
    <edc:Interrupt edc:cname="OC2Interrupt" edc:desc="OC2 - Output Compare 2" edc:irq="6"/>
    <edc:Interrupt edc:cname="T2Interrupt" edc:desc="T2 - Timer2" edc:irq="7"/>
    <edc:Interrupt edc:cname="T3Interrupt" edc:desc="T3 - Timer3" edc:irq="8"/>
    <edc:Interrupt edc:cname="SPI1ErrInterrupt" edc:desc="SPI1E - SPI1 Error" edc:irq="9"/>
    <edc:Interrupt edc:cname="SPI1Interrupt" edc:desc="SPI1 - SPI1 Transfer Done" edc:irq="10"/>
    <edc:Interrupt edc:cname="U1RXInterrupt" edc:desc="U1RX - UART1 Receiver" edc:irq="11"/>
    <edc:Interrupt edc:cname="U1TXInterrupt" edc:desc="U1TX - UART1 Transmitter" edc:irq="12"/>
    <edc:Interrupt edc:cname="ADC1Interrupt" edc:desc="ADC1 - A/D Converter 1" edc:irq="13"/>
    <edc:Interrupt edc:cname="SI2C1Interrupt" edc:desc="SI2C1 - I2C1 Slave Events" edc:irq="16"/>
    <edc:Interrupt edc:cname="MI2C1Interrupt" edc:desc="MI2C1 - I2C1 Master Events" edc:irq="17"/>
    <edc:Interrupt edc:cname="CompInterrupt" edc:desc="Comp - Comparator" edc:irq="18"/>
    <edc:Interrupt edc:cname="CNInterrupt" edc:desc="CN -  Change Notification Interrupt" edc:irq="19"/>
    <edc:Interrupt edc:cname="INT1Interrupt" edc:desc="INT1 - External Interrupt 1" edc:irq="20"/>
    <edc:Interrupt edc:cname="OC3Interrupt" edc:desc="OC3 - Output Compare 3" edc:irq="25"/>
    <edc:Interrupt edc:cname="OC4Interrupt" edc:desc="OC4 - Output Compare 4" edc:irq="26"/>
    <edc:Interrupt edc:cname="T4Interrupt" edc:desc="T4 - Timer4" edc:irq="27"/>
    <edc:Interrupt edc:cname="T5Interrupt" edc:desc="T5 - Timer5" edc:irq="28"/>
    <edc:Interrupt edc:cname="INT2Interrupt" edc:desc="INT2 - External Interrupt 2" edc:irq="29"/>
    <edc:Interrupt edc:cname="U2RXInterrupt" edc:desc="U2RX - UART2 Receiver" edc:irq="30"/>
    <edc:Interrupt edc:cname="U2TXInterrupt" edc:desc="U2TX - UART2 Transmitter" edc:irq="31"/>
    <edc:Interrupt edc:cname="SPI2ErrInterrupt" edc:desc="SPI2E - SPI2 Error" edc:irq="32"/>
    <edc:Interrupt edc:cname="SPI2Interrupt" edc:desc="SPI2 - SPI2 Transfer Done" edc:irq="33"/>
    <edc:Interrupt edc:cname="IC3Interrupt" edc:desc="IC3 - Input Capture 3" edc:irq="37"/>
    <edc:Interrupt edc:cname="IC4Interrupt" edc:desc="IC4 - Input Capture 4" edc:irq="38"/>
    <edc:Interrupt edc:cname="IC5Interrupt" edc:desc="IC5 - Input Capture 5" edc:irq="39"/>
    <edc:Interrupt edc:cname="OC5Interrupt" edc:desc="OC5 - Output Compare 5" edc:irq="41"/>
    <edc:Interrupt edc:cname="PMPInterrupt" edc:desc="PMP - Parallel Master Port" edc:irq="45"/>
    <edc:Interrupt edc:cname="SI2C2Interrupt" edc:desc="SI2C2 - I2C2 Slave Events" edc:irq="49"/>
    <edc:Interrupt edc:cname="MI2C2Interrupt" edc:desc="MI2C2 - I2C2 Master Events" edc:irq="50"/>
    <edc:Interrupt edc:cname="RTCCInterrupt" edc:desc="RTCC - Real-Time Clock and Calendar" edc:irq="62"/>
    <edc:Interrupt edc:cname="U1ErrInterrupt" edc:desc="U1E - UART1 Error" edc:irq="65"/>
    <edc:Interrupt edc:cname="U2ErrInterrupt" edc:desc="U2E - UART2 Error" edc:irq="66"/>
    <edc:Interrupt edc:cname="CRCInterrupt" edc:desc="CRC - Cyclic Redunancy Check" edc:irq="67"/>
    <edc:Interrupt edc:cname="LVDInterrupt" edc:desc="LVD - Low Voltage Detect" edc:irq="72"/>
    <edc:Interrupt edc:cname="CTMUInterrupt" edc:desc="CTMU - Interrupt" edc:irq="77"/>
  </edc:InterruptList>
  <edc:Breakpoints edc:hasdatacapture="true" edc:hwbpcount="0x5" edc:idbyte="x"/>
  <edc:ProgramSpace>
    <edc:ResetSector edc:beginaddr="0x0" edc:endaddr="0x4" edc:regionid="reset"/>
    <edc:VectorSector edc:beginaddr="0x04" edc:endaddr="0x100" edc:regionid="ivt"/>
    <edc:CodeSector edc:beginaddr="0x100" edc:endaddr="0x104" edc:isreserved="true" edc:regionid="_reserved"/>
    <edc:AltVectorSector edc:beginaddr="0x104" edc:endaddr="0x200" edc:regionid="aivt"/>
    <edc:CodeSector edc:beginaddr="0x200" edc:endaddr="0xabf8" edc:regionid="program"/>
    <edc:WORMHoleSector edc:beginaddr="0xabf8" edc:endaddr="0xac00" edc:regionid="cfgmem">
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x01" edc:srcaddr="0xabfe" edc:srcmask="0x1000"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x02" edc:srcaddr="0xabfe" edc:srcmask="0x2000"/>
      <edc:WORMHole edc:dstaddr="0xf80004" edc:dstmask="0x3f" edc:srcaddr="0xabfa" edc:srcmask="0x003f"/>
      <edc:WORMHole edc:dstaddr="0xf80006" edc:dstmask="0x80" edc:srcaddr="0xabfc" edc:srcmask="0x8000"/>
      <edc:WORMHole edc:dstaddr="0xf80006" edc:dstmask="0x07" edc:srcaddr="0xabfc" edc:srcmask="0x0700"/>
      <edc:WORMHole edc:dstaddr="0xf80008" edc:dstmask="0x03" edc:srcaddr="0xabfc" edc:srcmask="0x0003"/>
      <edc:WORMHole edc:dstaddr="0xf80008" edc:dstmask="0x20" edc:srcaddr="0xabfc" edc:srcmask="0x0020"/>
      <edc:WORMHole edc:dstaddr="0xf8000c" edc:dstmask="0x03" edc:srcaddr="0xabfa" edc:srcmask="0x0300"/>
      <edc:WORMHole edc:dstaddr="0xf80008" edc:dstmask="0x10" edc:srcaddr="0xabfc" edc:srcmask="0x0010"/>
      <edc:WORMHole edc:dstaddr="0xf80008" edc:dstmask="0xc0" edc:srcaddr="0xabfc" edc:srcmask="0x00c0"/>
      <edc:WORMHole edc:dstaddr="0xf8000a" edc:dstmask="0x0f" edc:srcaddr="0xabfe" edc:srcmask="0x000f"/>
      <edc:WORMHole edc:dstaddr="0xf8000a" edc:dstmask="0x10" edc:srcaddr="0xabfe" edc:srcmask="0x0010"/>
      <edc:WORMHole edc:dstaddr="0xf8000a" edc:dstmask="0x40" edc:srcaddr="0xabfe" edc:srcmask="0x0040"/>
      <edc:WORMHole edc:dstaddr="0xf8000a" edc:dstmask="0x80" edc:srcaddr="0xabfe" edc:srcmask="0x0080"/>
      <edc:WORMHole edc:dstaddr="0xf8000c" edc:dstmask="0x80" edc:srcaddr="0xabfa" edc:srcmask="0x8000"/>
      <edc:WORMHole edc:dstaddr="0xf8000c" edc:dstmask="0x40" edc:srcaddr="0xabfa" edc:srcmask="0x4000"/>
      <edc:WORMHole edc:dstaddr="0xf8000c" edc:dstmask="0x20" edc:srcaddr="0xabfa" edc:srcmask="0x2000"/>
      <edc:WORMHole edc:dstaddr="0xf80008" edc:dstmask="0x04" edc:srcaddr="0xabfc" edc:srcmask="0x0004"/>
      <edc:WORMHole edc:dstaddr="0xf8000c" edc:dstmask="0x0c" edc:srcaddr="0xabfa" edc:srcmask="0x0c00"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x03" edc:srcaddr="0xabfe" edc:srcmask="0x0300"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x80" edc:srcaddr="0xabfe" edc:srcmask="0x8000"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x40" edc:srcaddr="0xabfe" edc:srcmask="0x4000"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x80" edc:srcaddr="0xabfe" edc:srcmask="0x0800"/>
      <edc:WORMHole edc:dstaddr="0xf80010" edc:dstmask="0x0f" edc:srcaddr="0xabf8" edc:srcmask="0x000f"/>
      <edc:WORMHole edc:dstaddr="0xf80010" edc:dstmask="0x10" edc:srcaddr="0xabf8" edc:srcmask="0x0010"/>
      <edc:WORMHole edc:dstaddr="0xf80010" edc:dstmask="0x20" edc:srcaddr="0xabf8" edc:srcmask="0x0020"/>
      <edc:WORMHole edc:dstaddr="0xf80010" edc:dstmask="0x40" edc:srcaddr="0xabf8" edc:srcmask="0x0040"/>
      <edc:WORMHole edc:dstaddr="0xf80010" edc:dstmask="0x80" edc:srcaddr="0xabf8" edc:srcmask="0x0080"/>
      <edc:DCRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CONFIG4" edc:default="0xffff" edc:desc="" edc:impl="0xffff" edc:name="CONFIG4" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0xffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="DSWDTPS" edc:desc="DSWDT Postscale Select" edc:mask="0xf" edc:name="DSWDTPS" edc:nzwidth="4">
              <edc:DCRFieldSemantic edc:cname="DSWDTPSF" edc:desc="1:2,147,483,648 (25.7 days)" edc:when="(field &amp; 0xf) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPSE" edc:desc="1:536,870,912 (6.4 days)" edc:when="(field &amp; 0xf) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPSD" edc:desc="1:134,217,728 (38.5 hours)" edc:when="(field &amp; 0xf) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPSC" edc:desc="1:33,554,432 (9.6 hours)" edc:when="(field &amp; 0xf) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPSB" edc:desc="1:8,388,608 (2.4 hours)" edc:when="(field &amp; 0xf) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPSA" edc:desc="1:2,097,152 (36 minutes)" edc:when="(field &amp; 0xf) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS9" edc:desc="1:524,288 (9 minutes)" edc:when="(field &amp; 0xf) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS8" edc:desc="1:131,072 (135 seconds)" edc:when="(field &amp; 0xf) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS7" edc:desc="1:32,768 (34 seconds)" edc:when="(field &amp; 0xf) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS6" edc:desc="1:8,192 (8.5 seconds)" edc:when="(field &amp; 0xf) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS5" edc:desc="1:2,048 (2.1 seconds)" edc:when="(field &amp; 0xf) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS4" edc:desc="1:512 (528 ms)" edc:when="(field &amp; 0xf) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS3" edc:desc="1:128 (132 ms)" edc:when="(field &amp; 0xf) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS2" edc:desc="1:32 (33 ms)" edc:when="(field &amp; 0xf) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS1" edc:desc="1:8 (8.3 ms)" edc:when="(field &amp; 0xf) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS0" edc:desc="1:2 (2.1 ms)" edc:when="(field &amp; 0xf) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSWDTOSC" edc:desc="Deep Sleep Watchdog Timer Oscillator Select" edc:mask="0x1" edc:name="DSWCKSEL" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="DSWDT uses Low Power RC Oscillator (LPRC)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="DSWDT uses Secondary Oscillator (SOSC)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RTCOSC" edc:desc="RTCC Reference Oscillator  Select" edc:mask="0x1" edc:name="RTCCKSEL" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="RTCC uses Secondary Oscillator (SOSC)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="RTCC uses Low Power RC Oscillator (LPRC)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSBOREN" edc:desc="Deep Sleep BOR Enable bit" edc:mask="0x1" edc:name="DSBOREN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="BOR enabled in Deep Sleep" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="BOR disabled in Deep Sleep" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSWDTEN" edc:desc="Deep Sleep Watchdog Timer" edc:mask="0x1" edc:name="DSWDTEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="DSWDT enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="DSWDT disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RES1" edc:desc="Reserved" edc:ishidden="true" edc:islanghidden="true" edc:mask="0xff" edc:name="RES1" edc:nzwidth="8">
              <edc:DCRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0xff) == 0xff"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CONFIG3" edc:default="0xffff" edc:desc="" edc:impl="0xffff" edc:name="CONFIG3" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WPFP" edc:desc="Write Protection Flash Page Segment Boundary" edc:mask="0x3f" edc:name="WPFP" edc:nzwidth="0x6">
              <edc:DCRFieldSemantic edc:cname="WPFP0" edc:desc="Page 0 (0x0)" edc:when="(field &amp; 0x3f) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="WPFP1" edc:desc="Page 1 (0x400)" edc:when="(field &amp; 0x3f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WPFP2" edc:desc="Page 2 (0x800)" edc:when="(field &amp; 0x3f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="WPFP3" edc:desc="Page 3 (0xC00)" edc:when="(field &amp; 0x3f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="WPFP4" edc:desc="Page 4 (0x1000)" edc:when="(field &amp; 0x3f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="WPFP5" edc:desc="Page 5 (0x1400)" edc:when="(field &amp; 0x3f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="WPFP6" edc:desc="Page 6 (0x1800)" edc:when="(field &amp; 0x3f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="WPFP7" edc:desc="Page 7 (0x1C00)" edc:when="(field &amp; 0x3f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="WPFP8" edc:desc="Page 8 (0x2000)" edc:when="(field &amp; 0x3f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="WPFP9" edc:desc="Page 9 (0x2400)" edc:when="(field &amp; 0x3f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="WPFP10" edc:desc="Page 10 (0x2800)" edc:when="(field &amp; 0x3f) == 0xA"/>
              <edc:DCRFieldSemantic edc:cname="WPFP11" edc:desc="Page 11 (0x2C00)" edc:when="(field &amp; 0x3f) == 0xB"/>
              <edc:DCRFieldSemantic edc:cname="WPFP12" edc:desc="Page 12 (0x3000)" edc:when="(field &amp; 0x3f) == 0xC"/>
              <edc:DCRFieldSemantic edc:cname="WPFP13" edc:desc="Page 13 (0x3400)" edc:when="(field &amp; 0x3f) == 0xD"/>
              <edc:DCRFieldSemantic edc:cname="WPFP14" edc:desc="Page 14 (0x3800)" edc:when="(field &amp; 0x3f) == 0xE"/>
              <edc:DCRFieldSemantic edc:cname="WPFP15" edc:desc="Page 15 (0x3C00)" edc:when="(field &amp; 0x3f) == 0xF"/>
              <edc:DCRFieldSemantic edc:cname="WPFP16" edc:desc="Page 16 (0x4000)" edc:when="(field &amp; 0x3f) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="WPFP17" edc:desc="Page 17 (0x4400)" edc:when="(field &amp; 0x3f) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="WPFP18" edc:desc="Page 18 (0x4800)" edc:when="(field &amp; 0x3f) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="WPFP19" edc:desc="Page 19 (0x4C00)" edc:when="(field &amp; 0x3f) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="WPFP20" edc:desc="Page 20 (0x5000)" edc:when="(field &amp; 0x3f) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="WPFP21" edc:desc="Page 21 (0x5400)" edc:when="(field &amp; 0x3f) == 0x15"/>
              <edc:DCRFieldSemantic edc:cname="WPFP22" edc:desc="Page 22 (0x5800)" edc:when="(field &amp; 0x3f) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="WPFP23" edc:desc="Page 23 (0x5C00)" edc:when="(field &amp; 0x3f) == 0x17"/>
              <edc:DCRFieldSemantic edc:cname="WPFP24" edc:desc="Page 24 (0x6000)" edc:when="(field &amp; 0x3f) == 0x18"/>
              <edc:DCRFieldSemantic edc:cname="WPFP25" edc:desc="Page 25 (0x6400)" edc:when="(field &amp; 0x3f) == 0x19"/>
              <edc:DCRFieldSemantic edc:cname="WPFP26" edc:desc="Page 26 (0x6800)" edc:when="(field &amp; 0x3f) == 0x1A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP27" edc:desc="Page 27 (0x6C00)" edc:when="(field &amp; 0x3f) == 0x1B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP28" edc:desc="Page 28 (0x7000)" edc:when="(field &amp; 0x3f) == 0x1C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP29" edc:desc="Page 29 (0x7400)" edc:when="(field &amp; 0x3f) == 0x1D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP30" edc:desc="Page 30 (0x7800)" edc:when="(field &amp; 0x3f) == 0x1E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP31" edc:desc="Page 31 (0x7C00)" edc:when="(field &amp; 0x3f) == 0x1F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP32" edc:desc="Page 32 (0x8000)" edc:when="(field &amp; 0x3f) == 0x20"/>
              <edc:DCRFieldSemantic edc:cname="WPFP33" edc:desc="Page 33 (0x8400)" edc:when="(field &amp; 0x3f) == 0x21"/>
              <edc:DCRFieldSemantic edc:cname="WPFP34" edc:desc="Page 34 (0x8800)" edc:when="(field &amp; 0x3f) == 0x22"/>
              <edc:DCRFieldSemantic edc:cname="WPFP35" edc:desc="Page 35 (0x8C00)" edc:when="(field &amp; 0x3f) == 0x23"/>
              <edc:DCRFieldSemantic edc:cname="WPFP36" edc:desc="Page 36 (0x9000)" edc:when="(field &amp; 0x3f) == 0x24"/>
              <edc:DCRFieldSemantic edc:cname="WPFP37" edc:desc="Page 37 (0x9400)" edc:when="(field &amp; 0x3f) == 0x25"/>
              <edc:DCRFieldSemantic edc:cname="WPFP38" edc:desc="Page 38 (0x9800)" edc:when="(field &amp; 0x3f) == 0x26"/>
              <edc:DCRFieldSemantic edc:cname="WPFP39" edc:desc="Page 39 (0x9C00)" edc:when="(field &amp; 0x3f) == 0x27"/>
              <edc:DCRFieldSemantic edc:cname="WPFP40" edc:desc="Page 40 (0xA000)" edc:when="(field &amp; 0x3f) == 0x28"/>
              <edc:DCRFieldSemantic edc:cname="WPFP41" edc:desc="Page 41 (0xA400)" edc:when="(field &amp; 0x3f) == 0x29"/>
              <edc:DCRFieldSemantic edc:cname="WPFP42" edc:desc="Page 42 (0xA800)" edc:when="(field &amp; 0x3f) == 0x2A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP63" edc:desc="Highest Page (same as page 42)" edc:when="(field &amp; 0x3f) == 0x3f"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RES2" edc:desc="Reserved" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x3" edc:name="RES2" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SOSCSEL" edc:desc="Secondary Oscillator Pin Mode Select" edc:mask="0x3" edc:name="SOSCSEL" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="SOSC pins in Default (high drive-strength) Oscillator Mode" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="LPSOSC" edc:desc="SOSC pins in Low-Power (low drive-strength) Oscillator Mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="IO" edc:desc="SOSC pins have digital I/O functions (RA4, RB4)" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WUTSEL" edc:desc="Voltage Regulator Wake-up Time Select" edc:mask="0x3" edc:name="WUTSEL" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="LEG" edc:desc="Default regulator start-up time used" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="FST" edc:desc="Fast regulator start-up time used" edc:when="(field &amp; 0x3) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RES1" edc:desc="Reserved" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="RES1" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WPDIS" edc:desc="Segment Write Protection Disable" edc:mask="0x1" edc:name="WPDIS" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WPDIS" edc:desc="Segmented code protection disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WPEN" edc:desc="Segmented code protection enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WPCFG" edc:desc="Write Protect Configuration Page Select" edc:mask="0x1" edc:name="WPCFG" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WPCFGDIS" edc:desc="Last page and Flash Configuration words are unprotected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WPCFGEN" edc:desc="Last page and Flash Configuration words are code-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WPEND" edc:desc="Segment Write Protection End Page Select" edc:mask="0x1" edc:name="WPEND" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WPENDMEM" edc:desc="Write Protect from WPFP to the last page of memory" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WPSTARTMEM" edc:desc="Write Protect from page 0 to WPFP" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
