balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GA102.PIC
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPINR19" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111---11111" edc:name="RPINR19" edc:nzwidth="0x10" edc:por="---11111---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U2RXR" edc:desc="" edc:mask="0x1f" edc:name="U2RXR" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="U2CTSR" edc:desc="" edc:mask="0x1f" edc:name="U2CTSR" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U2RXR0" edc:desc="" edc:mask="0x1" edc:name="U2RXR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2RXR1" edc:desc="" edc:mask="0x1" edc:name="U2RXR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2RXR2" edc:desc="" edc:mask="0x1" edc:name="U2RXR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2RXR3" edc:desc="" edc:mask="0x1" edc:name="U2RXR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2RXR4" edc:desc="" edc:mask="0x1" edc:name="U2RXR4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U2CTSR0" edc:desc="" edc:mask="0x1" edc:name="U2CTSR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2CTSR1" edc:desc="" edc:mask="0x1" edc:name="U2CTSR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2CTSR2" edc:desc="" edc:mask="0x1" edc:name="U2CTSR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2CTSR3" edc:desc="" edc:mask="0x1" edc:name="U2CTSR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2CTSR4" edc:desc="" edc:mask="0x1" edc:name="U2CTSR4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPINR20" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111---11111" edc:name="RPINR20" edc:nzwidth="0x10" edc:por="---11111---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SDI1R" edc:desc="" edc:mask="0x1f" edc:name="SDI1R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SCK1R" edc:desc="" edc:mask="0x1f" edc:name="SCK1R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SDI1R0" edc:desc="" edc:mask="0x1" edc:name="SDI1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1R1" edc:desc="" edc:mask="0x1" edc:name="SDI1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1R2" edc:desc="" edc:mask="0x1" edc:name="SDI1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1R3" edc:desc="" edc:mask="0x1" edc:name="SDI1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1R4" edc:desc="" edc:mask="0x1" edc:name="SDI1R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SCK1R0" edc:desc="" edc:mask="0x1" edc:name="SCK1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK1R1" edc:desc="" edc:mask="0x1" edc:name="SCK1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK1R2" edc:desc="" edc:mask="0x1" edc:name="SCK1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK1R3" edc:desc="" edc:mask="0x1" edc:name="SCK1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK1R4" edc:desc="" edc:mask="0x1" edc:name="SCK1R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="RPINR21" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------11111" edc:name="RPINR21" edc:nzwidth="0x10" edc:por="-----------11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SS1R" edc:desc="" edc:mask="0x1f" edc:name="SS1R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SS1R0" edc:desc="" edc:mask="0x1" edc:name="SS1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1R1" edc:desc="" edc:mask="0x1" edc:name="SS1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1R2" edc:desc="" edc:mask="0x1" edc:name="SS1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1R3" edc:desc="" edc:mask="0x1" edc:name="SS1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1R4" edc:desc="" edc:mask="0x1" edc:name="SS1R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPINR22" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111---11111" edc:name="RPINR22" edc:nzwidth="0x10" edc:por="---11111---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SDI2R" edc:desc="" edc:mask="0x1f" edc:name="SDI2R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SCK2R" edc:desc="" edc:mask="0x1f" edc:name="SCK2R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SDI2R0" edc:desc="" edc:mask="0x1" edc:name="SDI2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI2R1" edc:desc="" edc:mask="0x1" edc:name="SDI2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI2R2" edc:desc="" edc:mask="0x1" edc:name="SDI2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI2R3" edc:desc="" edc:mask="0x1" edc:name="SDI2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI2R4" edc:desc="" edc:mask="0x1" edc:name="SDI2R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SCK2R0" edc:desc="" edc:mask="0x1" edc:name="SCK2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK2R1" edc:desc="" edc:mask="0x1" edc:name="SCK2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK2R2" edc:desc="" edc:mask="0x1" edc:name="SCK2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK2R3" edc:desc="" edc:mask="0x1" edc:name="SCK2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK2R4" edc:desc="" edc:mask="0x1" edc:name="SCK2R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="RPINR23" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------11111" edc:name="RPINR23" edc:nzwidth="0x10" edc:por="-----------11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SS2R" edc:desc="" edc:mask="0x1f" edc:name="SS2R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SS2R0" edc:desc="" edc:mask="0x1" edc:name="SS2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS2R1" edc:desc="" edc:mask="0x1" edc:name="SS2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS2R2" edc:desc="" edc:mask="0x1" edc:name="SS2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS2R3" edc:desc="" edc:mask="0x1" edc:name="SS2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS2R4" edc:desc="" edc:mask="0x1" edc:name="SS2R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="16"/>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPOR0" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000" edc:name="RPOR0" edc:nzwidth="0x10" edc:por="---00000---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP0R" edc:desc="" edc:mask="0x1f" edc:name="RP0R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP1R" edc:desc="" edc:mask="0x1f" edc:name="RP1R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP0R0" edc:desc="" edc:mask="0x1" edc:name="RP0R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP0R1" edc:desc="" edc:mask="0x1" edc:name="RP0R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP0R2" edc:desc="" edc:mask="0x1" edc:name="RP0R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP0R3" edc:desc="" edc:mask="0x1" edc:name="RP0R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP0R4" edc:desc="" edc:mask="0x1" edc:name="RP0R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP1R0" edc:desc="" edc:mask="0x1" edc:name="RP1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP1R1" edc:desc="" edc:mask="0x1" edc:name="RP1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP1R2" edc:desc="" edc:mask="0x1" edc:name="RP1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP1R3" edc:desc="" edc:mask="0x1" edc:name="RP1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP1R4" edc:desc="" edc:mask="0x1" edc:name="RP1R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPOR1" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000" edc:name="RPOR1" edc:nzwidth="0x10" edc:por="---00000---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP2R" edc:desc="" edc:mask="0x1f" edc:name="RP2R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP3R" edc:desc="" edc:mask="0x1f" edc:name="RP3R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP2R0" edc:desc="" edc:mask="0x1" edc:name="RP2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP2R1" edc:desc="" edc:mask="0x1" edc:name="RP2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP2R2" edc:desc="" edc:mask="0x1" edc:name="RP2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP2R3" edc:desc="" edc:mask="0x1" edc:name="RP2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP2R4" edc:desc="" edc:mask="0x1" edc:name="RP2R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP3R0" edc:desc="" edc:mask="0x1" edc:name="RP3R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP3R1" edc:desc="" edc:mask="0x1" edc:name="RP3R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP3R2" edc:desc="" edc:mask="0x1" edc:name="RP3R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP3R3" edc:desc="" edc:mask="0x1" edc:name="RP3R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP3R4" edc:desc="" edc:mask="0x1" edc:name="RP3R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPOR2" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000" edc:name="RPOR2" edc:nzwidth="0x10" edc:por="---00000---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP4R" edc:desc="" edc:mask="0x1f" edc:name="RP4R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP5R" edc:desc="" edc:mask="0x1f" edc:name="RP5R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP4R0" edc:desc="" edc:mask="0x1" edc:name="RP4R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R1" edc:desc="" edc:mask="0x1" edc:name="RP4R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R2" edc:desc="" edc:mask="0x1" edc:name="RP4R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R3" edc:desc="" edc:mask="0x1" edc:name="RP4R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R4" edc:desc="" edc:mask="0x1" edc:name="RP4R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP5R0" edc:desc="" edc:mask="0x1" edc:name="RP5R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP5R1" edc:desc="" edc:mask="0x1" edc:name="RP5R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP5R2" edc:desc="" edc:mask="0x1" edc:name="RP5R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP5R3" edc:desc="" edc:mask="0x1" edc:name="RP5R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP5R4" edc:desc="" edc:mask="0x1" edc:name="RP5R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
